for (let i = 0; i < 10; ++i) {
  // for는 반복문의 명령어 중 하나.
  // () 안에 변수 선언, 조건, 반복하며 달라져야할 코드, 변수 (반복하며 실행할 코드)
  // while과 마찬가지로 {} 내의 코드를 실행한다.
  console.log(`i = ${i}`);
  // = console.log("i = " + i);
  // ``(템플릿 리터럴)은 텍스트(string) 안에 변수를 넣고싶을때 사용한다.
  // `i = ${i}` === "i = " + i -> 두 개가 같다.

  //   console.log(`i 는 ${i < 5 ? "5보다 작다" : i === 5 ? "5다" : "5보다 크다"}`);
}

let j = 0;
for (; j < 10; ) {
  console.log(`j = ${j} `);
  ++j;
}

let w = 0;
while (w < 10) {
  console.log(`w=${w}`);
  ++w;
}

for (let a = 0, b = 1; a < 10 && b > -2; ++a, --b) {
  // && 는 '그리고' 이다. 즉, 두 조건이 한번에 만족해야만 실행한다.
  console.log(`a = ${a}, b = ${b}`);
}

for (let a = 0, b = 1; a < 10 || b > -2; ++a, --b) {
  // || 는 '또는' 이다. 즉, 두 조건중 하나라도 만족하면 실행한다.
  console.log(`a = ${a}, b = ${b}`);
  // 위에서 let a 썼는데 왜 또 쓸 수 있지? -> 내일 배운다
}

// 오늘의 숙제! 미연시 만들기
// prompt를 이용해서 입력값 받아서 선택지를 선택하고
// 선택한 선택지에 따라서 다른 질문이 나와야함
// 결론도 다르게 나와야한다.
// 만약 선택지가 1~4번까지 있을 때, 5를 선택하면 다시 선택하게 해야한다.

// 컴퓨터가 1 ~ 100사이의 하나의 숫자를 골라
// 사람이 하나의 숫자를 선택
// 숫자를 맞추면 끝
// 못맞추면 대소 비교해서 UP/DOWN
// 총 몇번 입력해ㅆ는지
// 맞췄을때 '축하합니다, 몇번 입력하셨습니다'
console.log(Mate.random()); // 0~1까지의 랜덤수
// parseInt(***)
